1- SETTING UP THE ENVIRONMENT

In [19]:
#INSTALLING REQUIRED LIBRARIES

%pip install pandas numpy matplotlib seaborn plotly

In [20]:
#IMPORTING LIBRARIES

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import plotly.express as px

In [21]:
#IMPORTING AND READING OUR DATA USING PANDAS

filepath = "data/Airplane_Crashes_and_Fatalities_Since_1908.csv"
data = pd.read_csv(filepath)

In [ ]:
2- EXPLORING DATASET

In [23]:
#PREVIEW OF OUR DATA ( EX FIRST 10 LINES )

data.head(10)

,Date,Time,Location,Operator,Flight #,Route,Type,Registration,cn/In,Aboard,Fatalities,Ground,Summary
0,09/17/1908,17:18,"Fort Myer, Virginia",Military - U.S. Army,NaN,Demonstration,Wright Flyer III,NaN,1,2.0,1.0,0.0,"During a demonstration flight, a U.S. Army fly..."
1,07/12/1912,06:30,"AtlantiCity, New Jersey",Military - U.S. Navy,NaN,Test flight,Dirigible,NaN,NaN,5.0,5.0,0.0,First U.S. dirigible Akron exploded just offsh...
2,08/06/1913,NaN,"Victoria, British Columbia, Canada",Private,-,NaN,Curtiss seaplane,NaN,NaN,1.0,1.0,0.0,The first fatal airplane accident in Canada oc...
3,09/09/1913,18:30,Over the North Sea,Military - German Navy,NaN,NaN,Zeppelin L-1 (airship),NaN,NaN,20.0,14.0,0.0,The airship flew into a thunderstorm and encou...
4,10/17/1913,10:30,"Near Johannisthal, Germany",Military - German Navy,NaN,NaN,Zeppelin L-2 (airship),NaN,NaN,30.0,30.0,0.0,Hydrogen gas which was being vented was sucked...
5,03/05/1915,01:00,"Tienen, Belgium",Military - German Navy,NaN,NaN,Zeppelin L-8 (airship),NaN,NaN,41.0,21.0,0.0,Crashed into trees while attempting to land af...
6,09/03/1915,15:20,"Off Cuxhaven, Germany",Military - German Navy,NaN,NaN,Zeppelin L-10 (airship),NaN,NaN,19.0,19.0,0.0,"Exploded and burned near Neuwerk Island, when..."
7,07/28/1916,NaN,"Near Jambol, Bulgeria",Military - German Army,NaN,NaN,Schutte-Lanz S-L-10 (airship),NaN,NaN,20.0,20.0,0.0,"Crashed near the Black Sea, cause unknown."
8,09/24/1916,01:00,"Billericay, England",Military - German Navy,NaN,NaN,Zeppelin L-32 (airship),NaN,NaN,22.0,22.0,0.0,Shot down by British aircraft crashing in flames.
9,10/01/1916,23:45,"Potters Bar, England",Military - German Navy,NaN,NaN,Zeppelin L-31 (airship),NaN,NaN,19.0,19.0,0.0,Shot down in flames by the British 39th Home D...

In [24]:
#SHAPES OF OUR DATE ( NUMBER OF LINES , NUMBER OF COLUMS )

data.shape

(5268, 13)

In [25]:
#DATA INFO ( COLUMNS + NON NULL VALUES + TYPE OF DATA )

data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5268 entries, 0 to 5267
Data columns (total 13 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Date          5268 non-null   object
 1   Time          3049 non-null   object
 2   Location      5248 non-null   object
 3   Operator      5250 non-null   object
 4   Flight #      1069 non-null   object
 5   Route         3562 non-null   object
 6   Type          5241 non-null   object
 7   Registration  4933 non-null   object
 8   cn/In         4040 non-null   object
 9   Aboard        5246 non-null   float64
 10  Fatalities    5256 non-null   float64
 11  Ground        5246 non-null   float64
 12  Summary       4878 non-null   object
dtypes: float64(3), object(10)
memory usage: 329.3+ KB

In [26]:
#DESCRIPTIVE STATISTICS OF OUR FLOATS DATA 

data.describe().T

             count       mean        std  min  25%   50%   75%     max
Aboard      5246.0  27.554518  43.076711  0.0  5.0  13.0  30.0   644.0
Fatalities  5256.0  20.068303  33.199952  0.0  3.0   9.0  23.0   583.0
Ground      5246.0   1.608845  53.987827  0.0  0.0   0.0   0.0  2750.0

In [ ]:
3- CLEANING DATASET

In [12]:
#IDENTIFYING THE NaN VALUES IN OUR DATA

data.isnull().sum()

Date               0
Time            2219
Location          20
Operator          18
Flight #        4199
Route           1706
Type              27
Registration     335
cn/In           1228
Aboard            22
Fatalities        12
Ground            22
Summary          390
dtype: int64

In [28]:
#IDENTIFYING THE DUPLICATED VALUES IN OUR DATA
#THERE IS NO DUPLICATED VALUES IN OUR DATASET

data.duplicated().sum()

0

In [ ]:
4- DATA VISUALIZATION

In [ ]:
plt.scatter(data['Date'], data['Fatalities'])